*******===> COBOL PLAY 2025 ===>
******* GnuCobol 3.2.0
******* Practice Sessions
******* Latest Update: December 9th, 2025
*******
000100 IDENTIFICATION DIVISION.
000200     PROGRAM-ID. latestupdate.
000300 ENVIRONMENT DIVISION.
000400 PROCEDURE DIVISION.
000500     DISPLAY "December 9th, 2025".
000600     STOP RUN.
000700 
		   