*******===> PLAYING WITH NUMBER DISPLAY FORMATS <===*
000100 IDENTIFICATION DIVISION.
000200        PROGRAM-ID. numberdisplay.
000300 
000400 DATA DIVISION.
000500 WORKING-STORAGE SECTION.
000600 01 WS-NUM1 PIC S9(3)V9(2).
000700 01 WS-NUM2 PIC PPP999.
000800 01 WS-NUM3 PIC S9(3)V9(2) VALUE -123.45.
000900 01 WS-NAME PIC A(6) VALUE 'ABCDEF'.
001000 01 WS-ID PIC X(5) VALUE 'A121$'.
001100        
001200  PROCEDURE DIVISION.
001300     DISPLAY "WS-NUM1 : "WS-NUM1.
001400     DISPLAY "WS-NUM2 : "WS-NUM2.
001500     DISPLAY "WS-NUM3 : "WS-NUM3.
001600     DISPLAY "WS-NAME : "WS-NAME.
001700     DISPLAY "WS-ID : "WS-ID.
001800     STOP RUN.
001900