       IDENTIFICATION DIVISION.
		     PROGRAM-ID.  SOMETHING.
       ENVIRONMENT DIVISION.
		     PROCEDURE DIVISION.
           DISPLAY 'THIS IS SOMETHING'.
           STOP RUN.
           